[
  {
    "tags": [
      "cisco",
      "first-step-to-switch"
    ],
    "description": "Cisco switch cihazlarına yapılandırmaya başlamak için switch ve IOS'u tanıyalım.",
    "title": "Cisco Switch'e ilk Adım",
    "content": "Tüm ağ cihazlarının her birinde birer işletim sistemi olmak zorundadır. Cisco Switch cihazlarında ise IOS işletim sistemi vardır. (Apple IOS ile karıştırmayın :-))\n\nBu makalemizde ise bu temel kullanım için bu IOS işletim sistemini nasıl configüre edebiliriz onu anlatacağım.\n\nÖncelikle Cisco Swicth cihazlarında herhangi bir GUI yok bu nedenle çoğu kişinin sevmediği ama biz network ve siber güvenlik ile uğraşan kişilerin sevdiği ve çokça aşina olduğu CLI ekranını kullanacağız \n\n## IOS CLI'a İlk Adımlar\n\nCisco IOS yazılımı bir güvenlik özelliği olarak, yönetim erişimini aşağıdaki gibi iki komut moduna ayırır:\n\n<span style=\"color:green\">User EXEC Mode (Kullanıcı EXEC Modu)</span>\n\n- Bu mod sadece kısıtlı sayıda temel monitoring (izleme) komutlarına izin verir.\n- Genellikle <em>yalnızca görüntüleme modu</em veya <em>enable mode</em> olarak adlandırılır.\n- Cihaz yapılandırmasına herhangi bir değişiklik yapılmasına izil verilmez.\n- CLI'da <code>SwitchAdı></code> ile gösterilir. \n\n\n<span style=\"color:green\">Privileged EXEC Mode (Ayrıcalıklı Exec Modu)</span>\n\n- Bu modda iken kullanıcı herhangi bir izleme komutunu kullanabilir, cihaza ait yapılandırma ve yönetim komutlarını yürütebilir.\n- Global Config modu gibi daha yüksek yapılandırma modlarına sadece bu moddan giriş yapılabilir.\n- CLI'da <code>SwitchAdı#</code> ile gösterilir. \n\n## Global Yapılandırma Modu ve Alt Yapılandırma Modları\n\nCisco switchlerini yapılandırmak için kullanıcının global yapılandırma modu olarak adlandırılan, global config moduna girmesi gerekir.\n\nGlobal yapılandırma modunda, cihazın bir bütün olarak çalışmasını etkileyen CLI yapılandırma değişiklikleri yapılır. Global yapılandırma modu, <code>Switch(config)#</code> gibi cihaz adından sonra biten bir <em>(config)#</em> istemiyle tanımlanır.\n\nGlobal Config moduna, diğer belirli yapılandırma modlarından önce erişilir. Kullanıcı global Config modundan farklı alt yapılandırma modlarına girebilir. Bu modların her biri, switchin belirli bir bölümünün veya işlevinin yapılandırılması için kullanılır. Alt yapılandırma modlarına iki örnek aşağıdaki gibidir.\n\n- **Line Config Mode** ⇒ Konsol, SSH, Telnet veya AUX erişimini yapılandırmak için kullanılır.\n- **Interface Config Mode** ⇒ Switch portunu veya Router ağ arayüzünü yapılandırmak için kullanılır.\n\nCLI kullanırken hangi modda olduğumuzu o moda ait komut istemi aracılığı ile öğreniriz. Varsayılan olarak her komut istemi cihazın adı ile başlar, daha sonra ise hangi modda olduğunu belirten ifade yer alır. Örneğin;\n\n- Global Config Mode ⇒ <code>SwitchAdı(config)#</code>\n- Line Config Mode ⇒ <code>SwitchAdı(config-line)#</code>\n- Interface Config Mode ⇒ <code>SwitchAdı(config-if)#</code>\n\n## Switch Modları Arasında Gezinelim\n\nSwicth modlarına girip çıkmak için özel komutlar kullanılır. User EXEC modundan Privileged EXEC moduna geçmek için <code>enable</code>komutu kullanılır. Kullanıcı EXEC moduna geri dönmek için ise Privileged EXEC modundayken <code>disable</code> komutunu kullanılır.\n\nGlobal Config moduna girmek için Privileged EXEC modundayken <code>configure terminal</code> modunu kullanılır. Global Config moddan Privileged EXEC moduna geri dönmek için ie <code>exit</code> komutu kullanılır.\n\nBirçok farklı alt yapılandırma modu vardır. Örneğin, Line Config moduna girmek için <code>line</code> komutu ve ardından erişmek istediğiniz yönetim line türünü ve numarasını kullanılır. Alt yapılandırma modundan çıkmak ve global yapılandırma moduna dönmek için exit komutu kullanılır.\n\n```\nSwitch(config)# line console 0\nSwitch(config-line)# exit\nSwitch(config)#\n```\n\nHerhangi bir alt yapılandırma modundan, modlar hiyerarşisine göre bi üst moda geçmek için <code>exit</code> komutu dışında <code>end</code> komutu ve Ctrl+Z tuş kombinasyonu kullanılabilir.\n\nAyrıca bir alt yapılandırma modundan diğerine doğrudan da geçebiliriz. Bir arayüzü seçtikten sonra komut isteminin değiştiğine dikkat edelim\n\n```\nSwitch(config-line)# interface FastEthernet 0/1\nSwitch(config-if)#\n```\n\n### Swicth modlarını daha hızlı değiştirelim\n\nSürekli configüre terminal gibi uzun mod değiştirme komutlarını kullanmak bazen can sıkıcı olabilir. Aşağıda sık kullanılan mod değiştirme komutlarının kısaltılmış verisyonlarını görebilirsiniz.\n|Komut|Kısa hali\n|-|-|\n|enable|en|\n|configure terminal|conf t|\n|interface FastEthernet 0/1| int fa0/1|\n|...|...|\nİlerleyen makalelerde daha fazla komut göreceğiz merak etmeyin :)\n\n\n",
    "categories": [
      "Switch & Router"
    ],
    "slug": "cisco-switch-e-ilk-adım",
    "ID": "1c86164b-7c68-4f8c-a9ab-c95ce427086b",
    "cover": "cover2.jpg",
    "date": "2022-06-08 12:00",
    "createdAt": 1654719373157,
    "updatedAt": 1654728512525
  },
  {
    "tags": [
      "cisco",
      "switch",
      "switch-config"
    ],
    "description": "Temel switch yapılandırmalarını yapalım.",
    "title": "Temel Switch Yapılandırması",
    "content": "## Switch Adını Değiştirelim\n\nBir switch yapılandırmaya başlarken ilk işimiz switch adını değiştirmek olmalıdır. Varsayılan olarak Cisco tarafından cihazlara <em>Switch</em> adı atanır. Sorun da tam olarak burada başlar. Bir ağda isim atanmamış tüm switchlerin adı aynı olduğunda uzaktan SSH ya da Telnet ile bağlanılan switchin hangi switch olduğunu anlamak karmaşık hale gelebilir.\n\nVarsayılan isim, daha açıklayıcı bir isimle değiştirilmelidir. İsimler akıllıca seçildiğinde, ağ cihazlarını hatırlamak, belgelemek ve tanımlamak daha kolay olacaktır. Hostlar için bazı önemli isimlendirme yönergeleri şunlardır:\n\n- Harf ile başlamalı\n- Boşluk içermemeli\n- Harf veya sayı ile bitmeli\n- Sadece harf, sayı ve tireler kullanılmalı\n- Uzunluğu 64 karakterden az olmalı\n\nAşağıda örnek bir switch adlandırması görmekteyiz. \n\n![örnek-switch-adlandırması](https://skorskyfiles.blob.core.windows.net/$web/articles/temel-switch-yapilandirmasi/ornek-adlandirma.png)\n\nİsimlendirmeler bu şekilde tanımlayıcı olduğu takdirde ilerleyen aşamalarda işimiz çok daha kolay hale gelecektir.\n\nBir switchin adını değiştirmek için global config modda iken <code>hostname</code> komutunun ardından verilmek istenen ismin girilmesi yeterlidir.\n\n```\nSwitch# configure terminal\nSwitch(config)# hostname Sw-Floor-1\nSw-Floor-1(config)#\n```\n\n## Switch Modlarını Şifreleyelim\nBir cihaza ilk defa bağlandığımızda User EXEC modundayız demektir. Örnekte gösterildiği gibi <code>line console 0</code> komutunu kullanarak konsol yapılandırma moduna geçiş yapıyoruz. 0 olarak bahsettiğimiz ilk ve genelde tek olan cihaz üzerindeki konsol girişini ifade eder. \n\nBu moda girdikten sonra <code>password</code> komutunu kullandıktan sonra vermek istediğimiz şifreyi girebiliriz. Son olarak <code>login</code> komutunu kullanarak User Exec modunu aktifleştirmemiz gerekiyor.\n\n```\nSw-Floor-1# configure terminal\nSw-Floor-1(config)# line console 0\nSw-Floor-1(config-line)# password skorskyblog\nSw-Floor-1(config-line)# login\nSw-Floor-1(config-line)# end\nSw-Floor-1#\n```\n\nArtık cihaz üzerinde bulunan konsol hattını şifreledik ancak cihaz üzerinde daha fazla yetkiye sahip olduğumuz Privileged modu da şifrelememiz güvenlik açısından elzem bir durumdur. Şimdi sıra privileged modda;\n\nPrivileged moda geçtikten sonra <code>enable secret</code> komutunun ardından istediğimiz şifreyi girebiliriz. \n```\nSw-Floor-1# configure terminal\nSw-Floor-1(config)# enable secret skorsky\nSw-Floor-1(config)# exit\nSw-Floor-1#\n```\n\nHenüz işimiz bitmedi şimdi sıra Cisco Switchlerde bulunan SSH ve Telnet gibi uzaktan bağlantı yapmamıza olanak sunan sanal vty hatlarını şirelemekte. Çoğu Cisco cihazında 0-15 aralığında numaralandırılmış 16 adet sanal vty hattı yer alır.\n\nBu sanal hatları şifrelemek için global config modda iken <code>line vty 0 15</code> komutunu kullanarak vty config moda geçiş yapıyoruz. Daha sonra <code>password</code> komutunun ardından istediğimiz şifreyi verebiliriz. Hemen ardından <code>login</code>\nkomutunu kullanarak vty erişimini etkinleştiriyoruz.\n\n```\nSw-Floor-1# configure terminal\nSw-Floor-1(config)# line vty 0 15\nSw-Floor-1(config-line)# password skorsky-line\nSw-Floor-1(config-line)# login \nSw-Floor-1(config-line)# end\nSw-Floor-1#\n```\n\nBuraya kadar her şey çok güzel ancak cihaz üzerinde çalışan yapılandırma dosyasında varsayılan olarak verilen parolalar açık olarak yer almaktadır bu da üst düzey bir güvenlik açığı yaratmaktadır. Aşağıda encrypte edilmemiş yapılandırma dosyasını görmektesiniz. \n![şifresiz config](https://skorskyfiles.blob.core.windows.net/$web/articles/temel-switch-yapilandirmasi/sifresiz-config.png)\n\nGörüldüğü üzere girilen tüm parolalar açıkça görülebilir halde şimdi bu parolaları encrypte edelim.\n\nGlobal config moda girdikten sonra <code>service password-encryption</code> komutunu girdiğimiz zaman cihazda yer alan parolalar artık encrypte edilmiş hale gelir.\n\n```\nSw-Floor-1# configure terminal\nSw-Floor-1(config)# service password-encryption\nSw-Floor-1(config)#\n```\n\nCihazda çalışan yapılandırmayı görmek için <code>show running-config</code> ya da daha kısa hali olan <code>sh run</code> komutunu girdikten sonra enter tuşu ile biraz alt satırlara indiğimizde aşağıdaki gibi bir ekran ile karşılaşacağız. \n```\nSw-Floor-1(config)# end\nSw-Floor-1# show running-config\n```\n![encrypte password](https://skorskyfiles.blob.core.windows.net/$web/articles/temel-switch-yapilandirmasi/sifreli-config.png)\n\nArtık şifrelerde encrypte olmuş halde. Durmak yok ilerlemeye devam. \n\n## Banner Mesajları Gösterelim\n![banner](https://skorskyfiles.blob.core.windows.net/$web/articles/temel-switch-yapilandirmasi/banner.png)\n\nCisco cihazına ilk eriştiğimizde yukarıdaki gibi bir banner mesajı verseydik güzel olmaz mıydı? Evet ben de aynı şekilde düşündüm. Hadi bir banner mesajı verelim.\n\nÖncelikle global config moda geçtikten sonra <code>banner motd</code> komutundan sonra banner mesajı içerisinde yer almayacak özel bir karakteri ayraç olarak kullanarak mesajımızı giriyoruz. Daha anlaşılır olması için örnek verelim.\n```\nSw-Floor-1# configure terminal\nSw-Floor-1(config)# banner motd !Authorized Access Only!\n```\n\n## Yapılandırmayı Kaydedelim\nSwitch üzerinde çeşitli değişiklikler yaptık çok güzel, fakat elektrik bağlantısı kesilirse ya da switch kapatılıp açılırsa ayarlar olduğu gibi korunacak mı? Hayır... Düzenlediğimiz ayarların geçici değil sürekli olmasını sağlamak için yapılandırma dosyasını Switch üzerinde bulunun NV-Ram'e kaydetmek gerekir. Hadi gelin bunu yapalım. \n\nPrivileged moda geçtikten sonra <code>copy running-config startup-config</code> komutunu kullanırız. Burada geçen iki argümanı açıklamak gerekirse;\n\n- running-config ⇒ Rastgele Erişimli Bellekte (RAM) saklanır. Geçerli yapılandırmayı yansıtır. Çalışan bir yapılandırma değiştirildiğinde Cisco cihazının çalışması derhal etkilenir. RAM uçucu hafızadır. Cihaz kapatıldığında veya yeniden başlatıldığında tüm içeriğini kaybeder. \n- startup-config . ⇒  NVRAM'de depolanan kaydedilmiş yapılandırma dosyasıdır. Cihazın açılışta veya yeniden başlatma sırasında kullanacağı tüm komutları içerir. Flash, cihaz kapatıldığında içeriğini kaybetmez.\n\n```\nSw-Floor-1# show running-config\n```\nSon olarak başlangıç yapılandırmasına istenmeyen değişikler kaydedildiyse yine privileged moda geçerek <code>erase startup-config</code> komutunu kullanarak NV-Ram'de yer alan yapılandırma dosyasını silebiliriz. Cihaz yeniden başladığında varsayılan yapılandırma dosyası ile birlikte tekrar açılacaktır. \n\nSonraki makalelerde görüşmek üzere hoşçakalın...\n",
    "categories": [
      "Switch & Router"
    ],
    "slug": "temel-switch-yapilandirmasi",
    "ID": "6849cc65-360b-46ca-afa0-006f3ee0dd81",
    "cover": "cover1.jpg",
    "date": "2022-06-09 12:00",
    "createdAt": 1654728343247,
    "updatedAt": 1654900801500
  },
  {
    "title": "Network Layer",
    "content": "## Ağ Katmanı Özellikleri\nAğ katmanı veya OSI 'nin 3.Katmanı, uç cihazların ağlar arasında veri alışverişini sağlayan hizmetler sunar. Ağ katmanı temel protokollerini IP versiyon 4 (IPv4) ve IP versiyon 6 (IPv6) oluşturmaktadır.  Diğer ağ katmanı protokolleri arasında Open Shortest Path First (OSPF) gibi yönlendirme protokolleri ve Internet Control Message Protocol (ICMP) gibi ileti protokolleri bulunur.\n![ag-katmani](https://skorskyfiles.blob.core.windows.net/$web/articles/ag-katmani/ag-katmani.jpg)\nAğ sınırları boyunca uçtan uca iletişimi gerçekleştirmek için ağ katmanı protokolleri dört temel işlem gerçekleştirir:\n\n-   **Uç cihazların adreslenmesi** ⇒ Uç aygıtlar, ağda yer edinebilmek için benzersiz bir IP adresiyle yapılandırılmalıdır.\n\n-   **Kapsülleme-** ⇒ Ağ katmanı, taşıma katmanının protokol veri birimini (PDU) bir pakete kapsüller. Kapsülleme işlemi, kaynak (gönderen) ve hedef (alıcı) hostların IP adresleri gibi bilgileri IP başlığına ekler. Kapsülleme işlemi IP paketinin kaynağı tarafından gerçekleştirilir.\n-   **Yönlendirme** ⇒ Ağ katmanı, paketleri başka bir ağdaki bir hedef hosta yönlendirmek için hizmetler sunar. Paket, başka ağlara ulaşabilmek için router tarafından işlenmelidir. Routerların rolü, yönlendirme (routing) olarak bilinen bir işlemle en iyi yolu seçmek ve paketleri hedef hosta yönlendirmektir. Bir paket, hedef hosta ulaşmadan önce birçok routerdan geçebilir. Hedef hosta ulaşmak için bir paketin geçtiği her routera, atlama (sekme) adı verilir.\n\n-   **Kapsül açma**  ⇒Paket hedef hostun ağ katmanına vardığında, host paketin IP başlığını kontrol eder. Başlık içindeki hedef IP adresi hostun IP adresiyle eşleşiyorsa, IP başlığı paketten kaldırılır. Ağ katmanı tarafından paketin kapsülü açıldıktan sonra, ortaya çıkan 4.Katman PDU'su taşıma katmanındaki uygun hizmete aktarılır. Kaspül açma işlemi, IP paketinin hedefi olan host tarafından gerçekleştirilir.\n\nHer bir host üzerinde çalışan işlemler arasındaki veri taşımasını yöneten taşıma katmanının (OSI 4.Katman) aksine, ağ katmanı iletişim protokolleri (örn., IPv4 ve IPv6) veriyi bir hosttan diğerine taşımak için kullanılan paket yapısını ve işlemleri belirler. Her bir pakette taşınan veriyi dikkate almadan çalışma, ağ katmanına birden çok host arasındaki birden çok türde iletişim için paket taşıma olanağı sağlar.\n![ip-gif](https://skorskyfiles.blob.core.windows.net/$web/articles/ag-katmani/The-Network-Layer.gif)\n\n## IP Kapsülleme\nIP, bir IP başlığı ekleyerek taşıma katmanını segmentini veya diğer verileri kapsüller. IP başlığı, paketi hedef hosta teslim etmek için kullanılır.\n![ip-kapsullleme](https://skorskyfiles.blob.core.windows.net/$web/articles/ag-katmani/ip-kapsulleme.jpg)\nVeri katmanını katman katman kapsülleme işlemi, farklı katmanlardaki hizmetlerin diğer katmanları etkilemeden geliştirilmesini ve ölçeklenmesini sağlar. Bu, taşıma katmanı segmentlerinin IPv4 , IPv6 veya gelecekte geliştirilebilecek herhangi bir yeni protokol ile kolayca paketlenebileceği anlamına gelir.\n\nIP başlığı, bir ağ üzerinden hedefine doğru ilerledikçe 3.Katman aygıtları (yani Routerlar ve 3.Katman switchler) tarafından incelenir. IP adresleme bilgisinin, IPv4 için Ağ Adresi Çevirisi (NAT) gerçekleştiren cihaz tarafından çevrilmesi haricinde, paketin kaynak hosttan ayrıldığı andan hedef hosta ulaşana kadar aynı kaldığını unutmamak önemlidir.\n\nRouterlar, paketleri ağlar arasında yönlendirmek için yönlendirme protokollerini uygular. Bu aracı aygıtlar tarafından gerçekleştirilen yönlendirme, paket başlığındaki ağ katmanı adreslemesini inceler. Her durumda, paketin veri bölümü, yani kapsüllenmiş taşıma katmanı PDU'su veya diğer veriler, ağ katmanı işlemleri sırasında değişmeden kalır.\n\n## Uç Cihazların Paketleri Yönlendirmesi\nHem IPv4 hem de IPv6 ile paketler her zaman kaynak hostta oluşturulur. Kaynak hostun, paketi hedef hosta yönlendirebilmesi gerekir. Bunu yapmak için, host uç aygıtları kendi yönlendirme tablosunu oluşturur. Bu konuda, uç aygıtların yönlendirme tablolarını nasıl kullandığı anlatılmaktadır.\n\nAğ katmanının diğer bir rolü, paketleri hostlar arasında yönlendirmektir. Host aşağıdakilere bir paket gönderebilir:\n\n-   **Kendisi**  ⇒ Bir host, 127.0.0.1 özel IPv4 adresine ya da ::1 IPv6 kendisine ping atabilir :( loopback arayüzü olarak adlandırılır.) Loopback arayüzü pinglendiğinde hosttaki TCP / IP protokol yığını test edilir.\n-   **Yerel host**  ⇒ Gönderen hostla aynı yerel ağdaki kaynak hosttur. Kaynak ve hedef host aynı ağ adresini paylaşır.\n-   **Uzak host**  ⇒  Bu, uzak ağdaki bir hedef hosttur. Kaynak ve hedef host aynı ağ adresini paylaşmazlar.\n![yonlendirme](https://skorskyfiles.blob.core.windows.net/$web/articles/ag-katmani/yonlendirme.jpg)\nBir paketin yerel bir hosta mı yoksa uzak bir hosta mı gönderileceği, kaynak uç cihaz tarafından belirlenir. Kaynak uç cihaz, hedef IP adresinin kendisi ile aynı ağda olup olmadığını belirler. Belirleme yöntemi IP sürümüne göre değişir:\n\n-   **IPv4'te**  ⇒ Kaynak aygıt, bunu belirlemek için kendi IPv4 adresi ve hedef IPv4 adresi ile birlikte kendi alt ağ maskesini kullanır.\n-   **IPv6'da**  ⇒ Yerel router, yerel ağ adresini (önek) ağdaki tüm cihazlara bildirir.\n\nBir ev veya iş ağında, LAN switchi veya kablosuz erişim noktası (WAP) gibi bir aracı kullanarak birbirine bağlı birkaç kablolu ve kablosuz cihazınız olabilir. Bu ara cihaz yerel ağdaki yerel hostlar arasında ara bağlantı sağlar. Yerel ana hostlar, herhangi bir ek cihaza ihtiyaç duymadan birbirlerine ulaşabilir ve bilgi paylaşabilir. Host, kendisiyle aynı IP ağı ile yapılandırılmış bir cihaza paket gönderiyorsa, paket basitçe host arayüzünden dışarı gönderilerek, ara cihaz üzerinden ve doğrudan hedef aygıta iletilir.\n\nElbette, çoğu durumda cihazlarımızın, diğer evler, işletmeler ve internet gibi yerel ağ segmentinin ötesine bağlanmasını isteriz. Yerel ağ segmentinin ötesindeki cihazlar uzak hostlar olarak bilinir. Bir kaynak cihaz, uzak bir hedef cihaza bir paket gönderdiğinde, routerların ve yönlendirmenin yardımına ihtiyaç duyulur. Yönlendirme, hedefe giden en iyi yolu belirleme işlemidir. Yerel ağ segmentine bağlı router, varsayılan ağ geçidi olarak anılır.\n\nBir sonraki makalemizde burada sıkça bahsettiğimiz IPv4 ve IPv6 neymiş daha detaylı inceleyebiliriz. Görüşmek üzere...",
    "categories": [
      "network"
    ],
    "description": "Ağ Katmanı",
    "slug": "ag-katmani",
    "tags": [
      "osi",
      "network-layer"
    ],
    "ID": "9835da93-deb7-4a31-b02e-7248355ec6ac",
    "cover": "network-layer.png",
    "date": "2022-06-20 12:00",
    "createdAt": 1655739041908,
    "updatedAt": 1656428160290
  }
]