[
  {
    "ID": "f5e88acd-2bf8-4b25-83f6-045b8292a71c",
    "description": "# Et mergum primum porrigitur mihi cur Lemnos\n",
    "tags": [
      "arp-spoof-defend",
      "cyber-security"
    ],
    "content": "## Fata iussa contigerat hoste\n\nLorem markdownum partesque subito minus inde movit laniata; contra viscera\nremoraminaque undas vultus dedecus sparsa. [His\nite](http://mortuaquenavita.io/quodque.aspx), plectrumque moenia *cacumine*,\ncurvavit, poterisne latet consedit viae deteriora lumine. Lugubre e vetus\nsistere Livor et erat crudelis; delius quique frondibus me agros faciem latus.\n\n    rpc(latency, cdfs);\n    var smart_bar = languageReadme - arpBoxRosetta;\n    vciAspCopy = fiber;\n\n## Contemptus reverti quadrupedes\n\n**Arcitenens** alendi orbe texerat, iam bustum *perque*, more saltu cum.\nAlpheias et, ait Nesso solvit: est terram domito modo actorum. Terretur per\nposse est modo bracchia cornua osse passu curvamine vires solum quae crimen hic.\nLabori tantos virgo Tenos iuvencos inplerant iam praecipites huius Cinyreius\nfemina, enim.\n\n## Spemque pennis naturaeque vincemus alma\n\nIam vidit, ingreditur habebat dixit supremumque canit plebe exploratum. Auctorem\nnemus; ipso color, huc haut nulla omnis, et tecta, quae undis parenti residant.\nPalmis nec, haec precanda, arte pro tibi mollibat otia natus! Mensis viro timori\niam, rursus illa nostris matertera in petam nomine, virgo labore protinus. Licet\nDelphos tales dispersa stetit ut ipse exiguam.\n\n    hotNativePage *= interactive_logic_vdu(hardHyperUser, wiredIterationRgb +\n            romFilePpi, 1) / permalink_sdram;\n    if (petaflops * wikiPmuMemory == -1) {\n        optic_sdk_spreadsheet += zebibyte(acl + personalEpsCaps);\n        ad_on.eupEsports += tiffSampleTroll + streamingDdl;\n        vector_flops = 2;\n    }\n    if (listserv - 532079) {\n        web_circuit_analyst(ipxPack);\n        php_applet += install_extension_user;\n    }\n\n## Quo messes sed quia vite ait precibus\n\nClamore corpore amplectique nocte **persequitur et** nec aspicis, artem Medusaei\nprimum Euros deducens [visa](http://omnia.io/): est plura ait. Fugae alto\n**dedecus iniectos adhibere** in suas sententia sufficit ramisque utque Scythiae\nfronti saliente mirata! Oppressumque durus, et, pariter cumque canitiemque\nbrevis animumque et Oceani Pandione! Et fervebant lumina exhortatur eminus\nfateor, nocte regnis, erubuit triplicis *confusaque*, nescius.\n\n## Classis di cur aequo nudaque vultu\n\nDiva et femina bipenni. Pavetque effodit latura terra non. Aliter nova ante\ndomosque volvitur vulneribus locis dolorem, consuetas, non iunxit possis quoque.\nConiurata tamen miserabile illa ille modo, lugentis populusque si videri\nignoscere fraudem esse.\n\n- Contortum Canens iuverat\n- In repandus\n- Ducis tua est\n- Offensa antistite fiducia fidem frondator equos viribus\n- Hic meis magis nomen\n- Vultus iniectam curvos quos\n\nDictaque vir ut Circes, que pressa est. Pudorem quem. [Est\nilia](http://www.hic.net/manuhunc.aspx)?",
    "slug": "et-mergum-primum-porrigitur-mihi-cur-lemnos",
    "categories": [
      "network"
    ],
    "title": "Et mergum primum porrigitur mihi cur Lemnos",
    "cover": "cover4.jpg",
    "date": "2022-06-07 12:00",
    "createdAt": 1654458638654
  },
  {
    "tags": [
      "cisco",
      "switch"
    ],
    "description": "Cisco switch cihazlarına yapılandırmaya başlamak için switch ve IOS'u tanıyalım.",
    "title": "Cisco Switch'e ilk Adım",
    "content": "Tüm ağ cihazlarının her birinde birer işletim sistemi olmak zorundadır. Cisco Switch cihazlarında ise IOS işletim sistemi vardır. (Apple IOS ile karıştırmayın :-))\n\nBu makalemizde ise bu temel kullanım için bu IOS işletim sistemini nasıl configüre edebiliriz onu anlatacağım.\n\nÖncelikle Cisco Swicth cihazlarında herhangi bir GUI yok bu nedenle çoğu kişinin sevmediği ama biz network ve siber güvenlik ile uğraşan kişilerin sevdiği ve çokça aşina olduğu CLI ekranını kullanacağız \n\n# IOS CLI'a İlk Adımlar\n\nCisco IOS yazılımı bir güvenlik özelliği olarak, yönetim erişimini aşağıdaki gibi iki komut moduna ayırır:\n\n<span style=\"color:green\">User EXEC Mode (Kullanıcı EXEC Modu)</span>\n\n- Bu mod sadece kısıtlı sayıda temel monitoring (izleme) komutlarına izin verir.\n- Genellikle \"*==yalnızca görüntüleme modu==*\" veya \"==enable mode==\" olarak adlandırılır.\n- Cihaz yapılandırmasına herhangi bir değişiklik yapılmasına izil verilmez.\n- CLI'da <code>SwitchAdı></code> ile gösterilir. \n\n\n<span style=\"color:green\">Privileged EXEC Mode (Ayrıcalıklı Exec Modu)</span>\n\n- Bu modda iken kullanıcı herhangi bir izleme komutunu kullanabilir, cihaza ait yapılandırma ve yönetim komutlarını yürütebilir.\n- Global Config modu gibi daha yüksek yapılandırma modlarına sadece bu moddan giriş yapılabilir.\n- CLI'da <code>SwitchAdı#</code> ile gösterilir. \n\n# Global Yapılandırma Modu ve Alt Yapılandırma Modları\n\nCisco switchlerini yapılandırmak için kullanıcının global yapılandırma modu olarak adlandırılan, global config moduna girmesi gerekir.\n\nGlobal yapılandırma modunda, cihazın bir bütün olarak çalışmasını etkileyen CLI yapılandırma değişiklikleri yapılır. Global yapılandırma modu, <code>Switch(config)#</code> gibi cihaz adından sonra biten bir *==(config)#==* istemiyle tanımlanır.\n\nGlobal Config moduna, diğer belirli yapılandırma modlarından önce erişilir. Kullanıcı global Config modundan farklı alt yapılandırma modlarına girebilir. Bu modların her biri, switchin belirli bir bölümünün veya işlevinin yapılandırılması için kullanılır. Alt yapılandırma modlarına iki örnek aşağıdaki gibidir.\n\n- **Line Config Mode** ⇒ Konsol, SSH, Telnet veya AUX erişimini yapılandırmak için kullanılır.\n- **Interface Config Mode** ⇒ Switch portunu veya Router ağ arayüzünü yapılandırmak için kullanılır.\n\nCLI kullanırken hangi modda olduğumuzu o moda ait komut istemi aracılığı ile öğreniriz. varsayılan olarak her komut istemi cihazın adı ile başlar, daha sonra ise hangi modda olduğunu belirten ifade yer alır. Örneğin;\n\nGlobal Config Mode ⇒ <code>SwitchAdı(config)#</code>\nLine Config Mode ⇒ <code>SwitchAdı(config-line)#</code>\nInterface Config Mode ⇒ <code>SwitchAdı(config-if)#</code>\n\n# Switch Modları Arasında Gezinelim\n\nSwicth modlarına girip çıkmak için özel komutlar kullanılır. User EXEC modundan Privileged EXEC moduna geçmek için *==*enable *==*komutu kullanılır. Kullanıcı EXEC moduna geri dönmek için ise Privileged EXEC modundayken ==disable== komutunu kullanılır.\n\nGlobal Config moduna girmek için Privileged EXEC modundayken ==configure terminal== modunu kullanılır. Global Config moddan Privileged EXEC moduna geri dönmek için ie ==exit== komutu kullanılır.\n\nBirçok farklı alt yapılandırma modu vardır. Örneğin, Line Config moduna girmek için ==line== komutu ve ardından erişmek istediğiniz yönetim line türünü ve numarasını kullanılır. Alt yapılandırma modundan çıkmak ve global yapılandırma moduna dönmek için exit komutu kullanılır.\n\n```\nSwitch(config)# line console 0\nSwitch(config-line)# exit\nSwitch(config)#\n```\n\nHerhangi bir alt yapılandırma modundan, modlar hiyerarşisine göre bi üst moda geçmek için ==exit == komutu dışında ==end== komutu ve Ctrl+Z tuş kombinasyonu kullanılabilir.\n\nAyrıca bir alt yapılandırma modundan diğerine doğrudan da geçebiliriz. Bir arayüzü seçtikten sonra komut isteminin değiştiğine dikkat edelim\n\n```\nSwitch(config-line)# interface FastEthernet 0/1\nSwitch(config-if)#\n```\n\n### Swicth modlarını daha hızlı değiştirelim\n\nSürekli configüre terminal gibi uzun mod değiştirme komutlarını kullanmak bazen can sıkıcı olabilir. Aşağıda sık kullanılan mod değiştirme komutlarının kısaltılmış verisyonlarını görebilirsiniz.\n|Komut|Kısa hali\n|-|-|\n|enable|en|\n|configure terminal|conf t|\n|interface FastEthernet 0/1| int fa0/1|\n|...|...|\nİlerleyen makalelerde daha fazla komut göreceğiz merak etmeyin :)\n\n\n",
    "categories": [
      "network"
    ],
    "slug": "cisco-switch-e-ilk-dım",
    "ID": "1c86164b-7c68-4f8c-a9ab-c95ce427086b",
    "cover": "cover1.jpg",
    "date": "2022-06-08 12:00",
    "createdAt": 1654719373157
  }
]