[
  {
    "ID": "4a9af399-b0ac-423a-b937-a069cfcd9292",
    "title": "Siber Güvenliğe İlk adım",
    "slug": "siber-guvenlige-ilk-adim",
    "content": "## Siber Güvenlik Nedir?\n\n**Siber güvenlik**; ağlarınızı, aygıtlarınızı, verilerinizi saldırı veya yetkisiz erişime karşı korumak için tasarlanmış teknolojiler, süreçler ve uygulamalardan oluşur. Ayrıca bilgi teknolojisi güvenliği olarak da adlandırılabilir. Siber güvenlik 3 tipik durumu hedef alır:\n\n- **Bireyler için** ⇒ Bireylerin güvende hissetmesi ve kişisel verilerinin güvenliğini ve gizliliğini sağlamak için kullanılır.\n- **Kurumlar için** ⇒ Kritik sistemlerin iş sürekliliğini (*kritik sistemlerin sürekli çalışır ve ulaşılabilir durumda olması*) ve veri sızıntısını önlemek amacıyla kullanılır. \n- **Devletler için** ⇒ Vatandaş, kurum ve devlet sistemlerinin siber tehditlere karşı korunmasını ve veri ihlalinin önlenmesinin sağlar. \n\n\n![siber güvenlik](https://skorskyfiles.blob.core.windows.net/$web/articles/siber%20g%C3%BCvenlik/siber%20g%C3%BCvenlik.jpg)\n\nYukarıda gösterilen Gizlilik, Bütünlük ve Erişebilirlik etmenleri doğru zamanda ve doğru şekilde birleştiği zaman Bilgi Güvenliği ve Siber güvenlik elde edilmiş olur.\n\n- **Gizlilik** ⇒ Bilginin yetkisiz kişilerin eline geçmemesi,\n- **Bütünlük** ⇒ Bilginin yetkisiz kişilerce değiştirilmemesi\n- **Erişilebilirlik** ⇒ Yetkili kişilerin ihtiyaç halinde sistemler ve bilgilere erişebilmesi demektir.\n\n## Siber Güvenlik Ne Değildir?\n\n![siber-guvenlik-ne-degildir](https://skorskyfiles.blob.core.windows.net/$web/articles/siber%20g%C3%BCvenlik/siber-guvenlik-ne-degildir.png)\n\nSiber güvenlik sadece etik hackerlık veya pentesterlık demek değildir. siber güvenlik çatısı oltında birçok alt başlık bulunmaktadır. ",
    "description": "siber güvenliğe ilk adım",
    "tags": [
      "cyber-security"
    ],
    "categories": [
      "cyber-security"
    ],
    "cover": "siber-guvenlik.jpg",
    "date": "2022-06-30",
    "createdAt": 1656591277308,
    "updatedAt": 1656591672462
  },
  {
    "slug": "network-tehditleri-ve-zararli-yazilimlar",
    "categories": [],
    "ID": "4b73cc67-ecb9-4ccc-9498-218af735459c",
    "description": "network-tehditleri",
    "title": "Ağ Tehditleri ve Zararlı Yazılımlar",
    "tags": [],
    "content": "## Tehdit, Güvenlik Açığı ve Risk\nZararlı yazılımlara başlamadan önce ağ güvenliği ile ilgili birkaç terimi incelemek faydalı olacaktır. \n\n- **Tehdit** - **Threat** ⇒ Veri veya ağın kendisi gibi bir varlık için potansiyel bir tehlike.\n- **Güvenlik açığı** - **Vulnerability** ⇒ Bir sistemde veya tasarımında bir tehdit tarafından sömürülebilecek bir zayıflık.\n- **Saldırı yüzeyi** - **Attack surface** ⇒ Saldırı yüzeyi, belirli bir sistemdeki saldırganın erişebildiği güvenlik açıklarının toplam toplamıdır. Saldırı yüzeyi, bir saldırganın sisteme girebileceği ve sistemden veri alabileceği farklı noktaları açıklar. Örneğin, işletim sisteminizin ve web tarayıcınızın her ikisinin de güvenlik yamalarına ihtiyacı olabilir. Her biri saldırılara karşı savunmasızdır ve ağda veya internette maruz kalırlar. Birlikte, tehdit aktörünün yararlanabileceği bir saldırı yüzeyi oluştururlar.\n- **Istismar** - **Exploit** ⇒ Bir varlığın güvenliğini aşmak üzere bir güvenlik açığından yararlanmak için kullanılan mekanizma. Açıklardan yararlanma girişimleri uzak veya yerel olabilir. Uzaktan yararlanma, hedef sisteme önceden erişmeden ağ üzerinden çalışan bir istismardır. Saldırganın bu güvenlik açığından yararlanabilmesi için son sistemde bir hesaba ihtiyacı yoktur. Yerel bir istismarda, tehdit aktörünün son sisteme bir tür kullanıcı veya yönetim erişimi vardır. Yerel bir istismar, saldırganın son sisteme fiziksel erişimi olduğu anlamına gelmez.\n-  **Risk** ⇒   Belirli bir tehdidin bir varlığın belirli bir güvenlik açığından yararlanma ve istenmeyen bir sonuçla sonuçlanma olasılığı.\n\n## Tehdit Aktörleri\nBirçok farklı tehdit aktörü vardır kısaca açıklamak gerekirse;\n\n- **Script kiddies** ⇒ 1990'larda ortaya çıktı ve gençlere veya deneyimsiz tehdit aktörlerine zarar vermek için mevcut senaryoları, araçları ve istismarları çalıştıran, ancak genellikle kar amacı gütmeyen kişilere atıfta bulunuyor.\n- **Vulnerability brokers** ⇒ Genellikle istismarları keşfetmeye ve bazen ödüller veya ödüller için satıcılara bildirmeye çalışan gri şapkalı bilgisayar korsanlarını ifade eder.\n- **Hacktivist** ⇒ Farklı siyasi ve sosyal fikirlere karşı toplanan ve protesto eden gri şapkalı bilgisayar korsanlarını ifade eden bir terimdir. Hacktivistler, makaleler, videolar yayınlayarak, hassas bilgileri sızdırarak ve dağıtılmış hizmet reddi (DDoS) saldırıları gerçekleştirerek kuruluşları veya hükümetleri açıkça protesto ederler.\n- **Cybercriminals** ⇒ Serbest meslek sahibi olan veya büyük siber suç örgütleri için çalışan siyah şapkalı bilgisayar korsanları için kullanılan bir terimdir. Her yıl, siber suçlular tüketicilerden ve işletmelerden milyarlarca dolar çalmaktan sorumludur.\n- **State-spoensered** ⇒ Devlet destekli bilgisayar korsanları, hükümet sırlarını çalan, istihbarat toplayan ve yabancı hükümetlerin, terörist grupların ve şirketlerin ağlarını sabote eden tehdit aktörleridir. Dünyadaki çoğu ülke, devlet destekli bilgisayar korsanlığına bir dereceye kadar katılmaktadır. Bir kişinin bakış açısına bağlı olarak, bunlar beyaz şapka veya siyah şapka korsanlarıdır.\n\n## Zararlı Yazılımlar\nUç cihazlar özellikle kötü amaçlı yazılım saldırılarına eğilimlidir. Verilere, ana bilgisayarlara veya ağlara zarar vermek, bozmak, çalmak veya genel olarak başka bir \"kötü\" veya gayrimeşru eylemde bulunmak için özel olarak tasarlanmış kod veya yazılımdır. Kötü amaçlı yazılımlar hakkında bilgi sahibi olmak önemlidir, çünkü tehdit aktörleri ve çevrimiçi suçlular, güvenlik açıklarından yararlanmaya yardımcı olmak için kullanıcıları kötü amaçlı yazılım yüklemeleri için sık sık kandırmaya çalışır. Buna ek olarak, kötü amaçlı yazılımlar o kadar hızlı bir şekilde değişir ki, kötü amaçlı yazılımdan koruma yazılımları yeni tehditleri durduracak kadar hızlı güncellenemediğinden, kötü amaçlı yazılımla ilgili güvenlik olayları son derece yaygındır.\n\n ### Virüsler ve Türleri\n  \n  Virüs, kendisinin bir kopyasını başka bir programa ekleyerek yayılan bir kötü amaçlı yazılım türüdür. Program çalıştırıldıktan sonra, virüsler bir bilgisayardan diğerine yayılarak bilgisayarlara bulaşır. Çoğu virüsün yayılması için insan yardımına ihtiyacı vardır. Örneğin, birisi virüslü bir USB sürücüsünü bilgisayarına bağladığında, virüs bilgisayara girer. Virüs daha sonra yeni bir USB sürücüsüne bulaşabilir ve yeni bilgisayarlara yayılabilir. Virüsler uzun bir süre uykuda kalabilir ve daha sonra belirli bir saat ve tarihte etkinleşebilir.\n\nBasit bir virüs, yürütülebilir bir dosyadaki ilk kod satırına kendini yükleyebilir. Etkinleştirildiğinde, virüs diskte diğer yürütülebilir dosyaları denetleyebilir, böylece henüz bulaşmamış tüm dosyalara bulaşabilir. Virüsler, ekranda resim görüntüleyenler gibi zararsız olabilir veya sabit sürücüdeki dosyaları değiştirenler veya silenler gibi yıkıcı olabilir. Virüsler, algılanmayı önlemek için mutasyona uğrayacak şekilde de programlanabilir.\n\nÇoğu virüs artık USB bellek sürücüleri, CD'ler, DVD'ler, ağ paylaşımları ve e-posta yoluyla yayılmaktadır. E-posta virüsleri yaygın bir virüs türüdür.\n\nBazı virüs türlerine ait bilgiler tabloda verilmiştir\n| Virüs Türü |İşlevi  |\n|--|--|\n|Boot| İşletim sistemi açılışında çalışarak kendini yükler|\n|Web Scripting| Web sayfaları ve tarayıcılarındaki açıkları istismar eder|\n|Hijacker|Web tarayıcı fonksiyonları ele geçirerek farklı sayfalara yönlendirme yapar|\n|Resident|RAM’e yerleşerek kalıcılık sağlar|\n|Polymorphic|Antivirüsten kaçmak için kodunu her açılışta yeniler|\n|Makro(VBA)|Kendi kodunu dosyalara eklerler|\n\n### Worms (Solucanlar)\n\nSolucanlar virüsler gibi sistem içinde çoğalırlar ancak virüslerden farklı olarak dosya ve programlara bulaşmazlar. Ayrıca insan etkileşimi veya herhangi bir tetikleyiciye ihtiyaç duymadan kendi kendine çoğalabilirler. \n\nArka kapı (Backdoor) yaratma, dosya silme, veri sızdırma, BOTNET'e sokma (zombie makine yapma) gib işlevleri vardır.\n\nSolucanlar, internetteki en yıkıcı saldırılardan bazılarından sorumludur. 2001 yılında, Code Red solucanı başlangıçta 658 sunucuya bulaşmıştı. 19 saat içinde solucan 300.000'den fazla sunucuya bulaşmıştı.\n\nEn bilinen solucan saldırısı ise [Stuxnet](https://tr.wikipedia.org/wiki/Stuxnet)'dir. *İlk siber silah* olarak da bilinir. Amerika tarafından İran nükleer çalışmalarını sekteye uğratatmak için kullanılmıştır.\n\n### Trojans (Truva Atları)\n\nTarihteki hikayesine benzer şekilde faydalı gözüken bir program vb. yardımcılığı ile sisteme girer ve sistem içinde amacını sessizce yerine getirir. Truva atı konsepti esnektir. Anında hasara neden olabilir, sisteme uzaktan erişim sağlayabilir veya bir arka kapıdan erişim sağlayabilir. Ayrıca, uzaktan talimat verildiği gibi, \"parola dosyasını bana haftada bir kez gönder\" gibi eylemleri de gerçekleştirebilir. Kötü amaçlı yazılımların siber suçluya veri gönderme eğilimi, saldırı göstergeleri için giden trafiği izleme ihtiyacını vurgulamaktadır.\nBelirli bir hedefe sahip olanlar gibi özel olarak yazılmış Truva atlarının tespit edilmesi zordur.\n\nTruva atları neden oldukları hasara veya bir sistemi ihlal etme biçimlerine göre sınıflara ayrılır.\n|Truva atı Türü| İşlev - Tarif  |\n|--|--|\n| Remote Access | Yetkisiz uzaktan erişimi etkinleştirir. |\n| Data Sending |    Tehdit aktörüne parolalar gibi hassas veriler sağlar. |\n| Destructive | Dosyaları bozar veya siler. |\n| Proxy | Saldırıları başlatmak ve diğer yasa dışı etkinlikleri gerçekleştirmek için kurbanın bilgisayarını kaynak cihaz olarak kullanır. |\n| FTP | Son cihazlarda yetkisiz dosya aktarım hizmetlerini etkinleştirir. |\n| Antivirüs disabler | Virüsten koruma programlarının veya güvenlik duvarlarının çalışmasını durdurur.  |\n| Denial of Service (DoS) | Ağ etkinliğini yavaşlatır veya durdurur. |\n| Keylogger | Bir web formuna girilen tuş vuruşlarını kaydederek kredi kartı numaraları gibi gizli bilgileri etkin bir şekilde çalmaya çalışır. |\n\n### Spywares (Casus Yazılımlar)\nİşletim sistemlerine bulaşarak farkındasız olarak kullanıcının hassas bilgilerini ifşa ederler\nParolalar, e mail adresleri , web tarayıcı geçmişi Sistem bilgileri , log dosyaları , kullanıcı aktiviteleri gibi bilgileri edinip sahibine iletmeyi hedefler.\n\n### Rootkit'ler\nÇalışma mantığı olarak işletim sistemi çekirdeğine sızması nedeniyle en tehlikeli virüs türleri arasındandır. Sistem içerisinde tam yetkiyle çalıştığı için eylemlerinde sınır yoktur. Ayrıca tespit edilebilmleri ve silinmeleri oldukça zordur. IoT cihazlarını da hedef alabilirler.\nVirüs worms ve trojan'ların tüm işlevlerini bünyesinde barındırır.\n\nBazı Rootkit türlerini kısaca açıklayalım\n|  |  |\n|--|--|\n| Kernel Rootkit | Çekirdek (Kernel) seviyesinde çalışır |\n| Firmware Rootkit  | Donanıma gömülü işletim sistemlerini hedefler\n|App Rootkit |Çekirdeğe değil , uygulamalara kod enjekte ederler|\n| Mem Rootkit  | Çekirdekte değil , RAM’de çalışırlar ve iyi gizlenirler |\n| BootLoader Rootkit  | Boot kayıtlarına yerleşir , dosya sisteminde ve antivirüslerde görünmezler |\n| Library Rootkit  | Kütüphane dosyalarını enfekte ederler |\n| Hypervisor Rootkit  | Sanallaştırma platformu katmanlarına yerleşirler , iyi gizlenirler |\n\n### Ransomwares (Fidye Yazılımları)\n\nTehdit aktörleri, yüklerini taşımak için ve diğer kötü amaçlı nedenlerle virüsleri, solucanları ve Truva atlarını kullandılar. Ancak, kötü amaçlı yazılımlar gelişmeye devam ediyor.\n\nŞu anda, en baskın kötü amaçlı yazılım fidye yazılımıdır. Fidye yazılımı, virüslü bilgisayar sistemine veya verilerine erişimi reddeden kötü amaçlı yazılımlardır. Siber suçlular daha sonra bilgisayar sistemini serbest bırakmak için ödeme talep ediyor.\n\nFidye yazılımı, tarihteki en karlı kötü amaçlı yazılım türü haline gelmek için gelişti. 2016'nın ilk yarısında, hem bireysel hem de kurumsal kullanıcıları hedefleyen fidye yazılımı kampanyaları daha yaygın ve güçlü hale geldi.\n\nDüzinelerce fidye yazılımı çeşidi var. Fidye yazılımı, sistem dosyalarını ve verilerini şifrelemek için sıklıkla bir şifreleme algoritması kullanır. Bilinen fidye yazılımı şifreleme algoritmalarının çoğunluğu kolayca çözülemez ve kurbanlara istenen fiyatı ödemekten başka çok az seçenek bırakır. Ödemeler genellikle Bitcoin ile ödenir, çünkü bitcoin kullanıcıları anonim kalabilir. Bitcoin, kimsenin sahip olmadığı veya kontrol etmediği açık kaynaklı, dijital bir para birimidir.\n\nKötü amaçlı yazılımlama olarak da bilinen e-posta ve kötü amaçlı reklamcılık, fidye yazılımı kampanyaları için vektörlerdir. Sosyal mühendislik, kendilerini güvenlik teknisyenleri olarak tanımlayan siber suçluların evleri arayıp kullanıcıları fidye yazılımını kullanıcının bilgisayarına indiren bir web sitesine bağlanmaya ikna etmeleri gibi kullanılır.\n\nBu liste, internet geliştikçe büyümeye devam edecektir. Yeni kötü amaçlı yazılımlar her zaman geliştirilecektir. Siber güvenlik operasyonlarının temel amacı, yeni kötü amaçlı yazılımlar hakkında bilgi edinmek ve bunları derhal nasıl azaltmaktır.\n\n## Antivirüslerin Çalışma Prensiplerinin Temeli\n\n\n- **Byte-Signature** ⇒ Yazılımın (virüsün) makine dilindeki karşılığından bir bölümü alınarak tanınır.\n- **Hash-Signature** ⇒ Yazılımın **hash** değeri alınarak tanınır . En ufak bir değişiklikte tanınamaz olacağı için risklidir\n- **Heuristic** ⇒ Sezgisel tanıdır . Kodun içeriğinden çok davranışları izlenerek tanınmaya çalışılır Performans ve zaman kaybettirebilir.\nBu konuyu daha detaylı bir başka makalemizde inceleyeceğiz.\n\n",
    "cover": "malware.png",
    "date": "2022-07-01",
    "createdAt": 1656629450258
  }
]