[
  {
    "ID": "4a9af399-b0ac-423a-b937-a069cfcd9292",
    "title": "Siber Güvenliğe İlk adım",
    "slug": "siber-guvenlige-ilk-adim",
    "content": "## Siber Güvenlik Nedir?\n\n**Siber güvenlik**; ağlarınızı, aygıtlarınızı, verilerinizi saldırı veya yetkisiz erişime karşı korumak için tasarlanmış teknolojiler, süreçler ve uygulamalardan oluşur. Ayrıca bilgi teknolojisi güvenliği olarak da adlandırılabilir. Siber güvenlik 3 tipik durumu hedef alır:\n\n- **Bireyler için** ⇒ Bireylerin güvende hissetmesi ve kişisel verilerinin güvenliğini ve gizliliğini sağlamak için kullanılır.\n- **Kurumlar için** ⇒ Kritik sistemlerin iş sürekliliğini (*kritik sistemlerin sürekli çalışır ve ulaşılabilir durumda olması*) ve veri sızıntısını önlemek amacıyla kullanılır. \n- **Devletler için** ⇒ Vatandaş, kurum ve devlet sistemlerinin siber tehditlere karşı korunmasını ve veri ihlalinin önlenmesinin sağlar. \n\n\n![siber güvenlik](https://skorskyfiles.blob.core.windows.net/$web/articles/siber%20g%C3%BCvenlik/siber%20g%C3%BCvenlik.jpg)\n\nYukarıda gösterilen Gizlilik, Bütünlük ve Erişebilirlik etmenleri doğru zamanda ve doğru şekilde birleştiği zaman Bilgi Güvenliği ve Siber güvenlik elde edilmiş olur.\n\n- **Gizlilik** ⇒ Bilginin yetkisiz kişilerin eline geçmemesi,\n- **Bütünlük** ⇒ Bilginin yetkisiz kişilerce değiştirilmemesi\n- **Erişilebilirlik** ⇒ Yetkili kişilerin ihtiyaç halinde sistemler ve bilgilere erişebilmesi demektir.\n\n## Siber Güvenlik Ne Değildir?\n\n![siber-guvenlik-ne-degildir](https://skorskyfiles.blob.core.windows.net/$web/articles/siber%20g%C3%BCvenlik/siber-guvenlik-ne-degildir.png)\n\nSiber güvenlik sadece etik hackerlık veya pentesterlık demek değildir. siber güvenlik çatısı altında birçok alt başlık bulunmaktadır. \n\nBu makalemizle birlikte siber güvenliğe ilk adımı atmış bulunuyoruz. Siber güvenlik adına birçok makale gelmeye devam edecek...",
    "description": "siber güvenliğe ilk adım",
    "tags": [
      "cyber-security"
    ],
    "categories": [
      "Siber Güvenlik"
    ],
    "cover": "siber-guvenlik.jpg",
    "date": "2022-06-30",
    "createdAt": 1656591277308,
    "updatedAt": 1656693960143
  },
  {
    "slug": "zararli-yazilimlar",
    "categories": [
      "Siber Güvenlik"
    ],
    "ID": "4b73cc67-ecb9-4ccc-9498-218af735459c",
    "description": "network-tehditleri",
    "title": "Zararlı Yazılımlar",
    "tags": [
      "malware"
    ],
    "content": "## Tehdit, Güvenlik Açığı ve Risk\nZararlı yazılımlara başlamadan önce ağ güvenliği ile ilgili birkaç terimi incelemek faydalı olacaktır. \n\n- **Tehdit** - **Threat** ⇒ Veri veya ağın kendisi gibi bir varlık için potansiyel bir tehlike.\n- **Güvenlik açığı** - **Vulnerability** ⇒ Bir sistemde veya tasarımında bir tehdit tarafından sömürülebilecek bir zayıflık.\n- **Saldırı yüzeyi** - **Attack surface** ⇒ Saldırı yüzeyi, belirli bir sistemdeki saldırganın erişebildiği güvenlik açıklarının toplam toplamıdır. Saldırı yüzeyi, bir saldırganın sisteme girebileceği ve sistemden veri alabileceği farklı noktaları açıklar. Örneğin, işletim sisteminizin ve web tarayıcınızın her ikisinin de güvenlik yamalarına ihtiyacı olabilir. Her biri saldırılara karşı savunmasızdır ve ağda veya internette maruz kalırlar. Birlikte, tehdit aktörünün yararlanabileceği bir saldırı yüzeyi oluştururlar.\n- **Istismar** - **Exploit** ⇒ Bir varlığın güvenliğini aşmak üzere bir güvenlik açığından yararlanmak için kullanılan mekanizma. Açıklardan yararlanma girişimleri uzak veya yerel olabilir. Uzaktan yararlanma, hedef sisteme önceden erişmeden ağ üzerinden çalışan bir istismardır. Saldırganın bu güvenlik açığından yararlanabilmesi için son sistemde bir hesaba ihtiyacı yoktur. Yerel bir istismarda, tehdit aktörünün son sisteme bir tür kullanıcı veya yönetim erişimi vardır. Yerel bir istismar, saldırganın son sisteme fiziksel erişimi olduğu anlamına gelmez.\n-  **Risk** ⇒   Belirli bir tehdidin bir varlığın belirli bir güvenlik açığından yararlanma ve istenmeyen bir sonuçla sonuçlanma olasılığı.\n\n## Tehdit Aktörleri\nBirçok farklı tehdit aktörü vardır kısaca açıklamak gerekirse;\n\n- **Script kiddies** ⇒ 1990'larda ortaya çıktı ve gençlere veya deneyimsiz tehdit aktörlerine zarar vermek için mevcut senaryoları, araçları ve istismarları çalıştıran, ancak genellikle kar amacı gütmeyen kişilere atıfta bulunuyor.\n- **Vulnerability brokers** ⇒ Genellikle istismarları keşfetmeye ve bazen ödüller veya ödüller için satıcılara bildirmeye çalışan gri şapkalı bilgisayar korsanlarını ifade eder.\n- **Hacktivist** ⇒ Farklı siyasi ve sosyal fikirlere karşı toplanan ve protesto eden gri şapkalı bilgisayar korsanlarını ifade eden bir terimdir. Hacktivistler, makaleler, videolar yayınlayarak, hassas bilgileri sızdırarak ve dağıtılmış hizmet reddi (DDoS) saldırıları gerçekleştirerek kuruluşları veya hükümetleri açıkça protesto ederler.\n- **Cybercriminals** ⇒ Serbest meslek sahibi olan veya büyük siber suç örgütleri için çalışan siyah şapkalı bilgisayar korsanları için kullanılan bir terimdir. Her yıl, siber suçlular tüketicilerden ve işletmelerden milyarlarca dolar çalmaktan sorumludur.\n- **State-spoensered** ⇒ Devlet destekli bilgisayar korsanları, hükümet sırlarını çalan, istihbarat toplayan ve yabancı hükümetlerin, terörist grupların ve şirketlerin ağlarını sabote eden tehdit aktörleridir. Dünyadaki çoğu ülke, devlet destekli bilgisayar korsanlığına bir dereceye kadar katılmaktadır. Bir kişinin bakış açısına bağlı olarak, bunlar beyaz şapka veya siyah şapka korsanlarıdır.\n\n## Zararlı Yazılımlar\nUç cihazlar özellikle kötü amaçlı yazılım saldırılarına eğilimlidir. Verilere, ana bilgisayarlara veya ağlara zarar vermek, bozmak, çalmak veya genel olarak başka bir \"kötü\" veya gayrimeşru eylemde bulunmak için özel olarak tasarlanmış kod veya yazılımdır. Kötü amaçlı yazılımlar hakkında bilgi sahibi olmak önemlidir, çünkü tehdit aktörleri ve çevrimiçi suçlular, güvenlik açıklarından yararlanmaya yardımcı olmak için kullanıcıları kötü amaçlı yazılım yüklemeleri için sık sık kandırmaya çalışır. Buna ek olarak, kötü amaçlı yazılımlar o kadar hızlı bir şekilde değişir ki, kötü amaçlı yazılımdan koruma yazılımları yeni tehditleri durduracak kadar hızlı güncellenemediğinden, kötü amaçlı yazılımla ilgili güvenlik olayları son derece yaygındır.\n\n ### Virüsler\n  \n  Virüs, kendisinin bir kopyasını başka bir programa ekleyerek yayılan bir kötü amaçlı yazılım türüdür. Program çalıştırıldıktan sonra, virüsler bir bilgisayardan diğerine yayılarak bilgisayarlara bulaşır. Çoğu virüsün yayılması için insan yardımına ihtiyacı vardır. Örneğin, birisi virüslü bir USB sürücüsünü bilgisayarına bağladığında, virüs bilgisayara girer. Virüs daha sonra yeni bir USB sürücüsüne bulaşabilir ve yeni bilgisayarlara yayılabilir. Virüsler uzun bir süre uykuda kalabilir ve daha sonra belirli bir saat ve tarihte etkinleşebilir.\n\nBasit bir virüs, yürütülebilir bir dosyadaki ilk kod satırına kendini yükleyebilir. Etkinleştirildiğinde, virüs diskte diğer yürütülebilir dosyaları denetleyebilir, böylece henüz bulaşmamış tüm dosyalara bulaşabilir. Virüsler, ekranda resim görüntüleyenler gibi zararsız olabilir veya sabit sürücüdeki dosyaları değiştirenler veya silenler gibi yıkıcı olabilir. Virüsler, algılanmayı önlemek için mutasyona uğrayacak şekilde de programlanabilir.\n\nÇoğu virüs artık USB bellek sürücüleri, CD'ler, DVD'ler, ağ paylaşımları ve e-posta yoluyla yayılmaktadır. E-posta virüsleri yaygın bir virüs türüdür.\n\nBazı virüs türlerine ait bilgiler tabloda verilmiştir\n| Virüs Türü |İşlevi  |\n|--|--|\n|Boot| İşletim sistemi açılışında çalışarak kendini yükler|\n|Web Scripting| Web sayfaları ve tarayıcılarındaki açıkları istismar eder|\n|Hijacker|Web tarayıcı fonksiyonları ele geçirerek farklı sayfalara yönlendirme yapar|\n|Resident|RAM’e yerleşerek kalıcılık sağlar|\n|Polymorphic|Antivirüsten kaçmak için kodunu her açılışta yeniler|\n|Makro(VBA)|Kendi kodunu dosyalara eklerler|\n\n### Worms (Solucanlar)\n\nSolucanlar virüsler gibi sistem içinde çoğalırlar ancak virüslerden farklı olarak dosya ve programlara bulaşmazlar. Ayrıca insan etkileşimi veya herhangi bir tetikleyiciye ihtiyaç duymadan kendi kendine çoğalabilirler. \n\nArka kapı (Backdoor) yaratma, dosya silme, veri sızdırma, BOTNET'e sokma (zombie makine yapma) gib işlevleri vardır.\n\nSolucanlar, internetteki en yıkıcı saldırılardan bazılarından sorumludur. 2001 yılında, Code Red solucanı başlangıçta 658 sunucuya bulaşmıştı. 19 saat içinde solucan 300.000'den fazla sunucuya bulaşmıştı.\n\nEn bilinen solucan saldırısı ise [Stuxnet](https://tr.wikipedia.org/wiki/Stuxnet)'dir. *İlk siber silah* olarak da bilinir. Amerika tarafından İran nükleer çalışmalarını sekteye uğratatmak için kullanılmıştır.\n\n### Trojans (Truva Atları)\n\nTarihteki hikayesine benzer şekilde faydalı gözüken bir program vb. yardımcılığı ile sisteme girer ve sistem içinde amacını sessizce yerine getirir. Truva atı konsepti esnektir. Anında hasara neden olabilir, sisteme uzaktan erişim sağlayabilir veya bir arka kapıdan erişim sağlayabilir. Ayrıca, uzaktan talimat verildiği gibi, \"parola dosyasını bana haftada bir kez gönder\" gibi eylemleri de gerçekleştirebilir. Kötü amaçlı yazılımların siber suçluya veri gönderme eğilimi, saldırı göstergeleri için giden trafiği izleme ihtiyacını vurgulamaktadır.\nBelirli bir hedefe sahip olanlar gibi özel olarak yazılmış Truva atlarının tespit edilmesi zordur.\n\nTruva atları neden oldukları hasara veya bir sistemi ihlal etme biçimlerine göre sınıflara ayrılır.\n|Truva atı Türü| İşlev - Tarif  |\n|--|--|\n| Remote Access | Yetkisiz uzaktan erişimi etkinleştirir. |\n| Data Sending |    Tehdit aktörüne parolalar gibi hassas veriler sağlar. |\n| Destructive | Dosyaları bozar veya siler. |\n| Proxy | Saldırıları başlatmak ve diğer yasa dışı etkinlikleri gerçekleştirmek için kurbanın bilgisayarını kaynak cihaz olarak kullanır. |\n| FTP | Son cihazlarda yetkisiz dosya aktarım hizmetlerini etkinleştirir. |\n| Antivirüs disabler | Virüsten koruma programlarının veya güvenlik duvarlarının çalışmasını durdurur.  |\n| Denial of Service (DoS) | Ağ etkinliğini yavaşlatır veya durdurur. |\n| Keylogger | Bir web formuna girilen tuş vuruşlarını kaydederek kredi kartı numaraları gibi gizli bilgileri etkin bir şekilde çalmaya çalışır. |\n\n### Spywares (Casus Yazılımlar)\nİşletim sistemlerine bulaşarak farkındasız olarak kullanıcının hassas bilgilerini ifşa ederler\nParolalar, e mail adresleri , web tarayıcı geçmişi Sistem bilgileri , log dosyaları , kullanıcı aktiviteleri gibi bilgileri edinip sahibine iletmeyi hedefler.\n\n### Rootkit'ler\nÇalışma mantığı olarak işletim sistemi çekirdeğine sızması nedeniyle en tehlikeli virüs türleri arasındandır. Sistem içerisinde tam yetkiyle çalıştığı için eylemlerinde sınır yoktur. Ayrıca tespit edilebilmleri ve silinmeleri oldukça zordur. IoT cihazlarını da hedef alabilirler.\nVirüs worms ve trojan'ların tüm işlevlerini bünyesinde barındırır.\n\nBazı Rootkit türlerini kısaca açıklayalım\n| Rootkit Türü | İşlevi |\n|--|--|\n| Kernel Rootkit | Çekirdek (Kernel) seviyesinde çalışır |\n| Firmware Rootkit  | Donanıma gömülü işletim sistemlerini hedefler\n|App Rootkit |Çekirdeğe değil , uygulamalara kod enjekte ederler|\n| Mem Rootkit  | Çekirdekte değil , RAM’de çalışırlar ve iyi gizlenirler |\n| BootLoader Rootkit  | Boot kayıtlarına yerleşir , dosya sisteminde ve antivirüslerde görünmezler |\n| Library Rootkit  | Kütüphane dosyalarını enfekte ederler |\n| Hypervisor Rootkit  | Sanallaştırma platformu katmanlarına yerleşirler , iyi gizlenirler |\n\n### Ransomwares (Fidye Yazılımları)\n\nTehdit aktörleri, yüklerini taşımak için ve diğer kötü amaçlı nedenlerle virüsleri, solucanları ve Truva atlarını kullandılar. Ancak, kötü amaçlı yazılımlar gelişmeye devam ediyor.\n\nŞu anda, en baskın kötü amaçlı yazılım fidye yazılımıdır. Fidye yazılımı, virüslü bilgisayar sistemine veya verilerine erişimi reddeden kötü amaçlı yazılımlardır. Siber suçlular daha sonra bilgisayar sistemini serbest bırakmak için ödeme talep ediyor.\n\nFidye yazılımı, tarihteki en karlı kötü amaçlı yazılım türü haline gelmek için gelişti. 2016'nın ilk yarısında, hem bireysel hem de kurumsal kullanıcıları hedefleyen fidye yazılımı kampanyaları daha yaygın ve güçlü hale geldi.\n\nDüzinelerce fidye yazılımı çeşidi var. Fidye yazılımı, sistem dosyalarını ve verilerini şifrelemek için sıklıkla bir şifreleme algoritması kullanır. Bilinen fidye yazılımı şifreleme algoritmalarının çoğunluğu kolayca çözülemez ve kurbanlara istenen fiyatı ödemekten başka çok az seçenek bırakır. Ödemeler genellikle Bitcoin ile ödenir, çünkü bitcoin kullanıcıları anonim kalabilir. Bitcoin, kimsenin sahip olmadığı veya kontrol etmediği açık kaynaklı, dijital bir para birimidir.\n\nKötü amaçlı yazılımlama olarak da bilinen e-posta ve kötü amaçlı reklamcılık, fidye yazılımı kampanyaları için vektörlerdir. Sosyal mühendislik, kendilerini güvenlik teknisyenleri olarak tanımlayan siber suçluların evleri arayıp kullanıcıları fidye yazılımını kullanıcının bilgisayarına indiren bir web sitesine bağlanmaya ikna etmeleri gibi kullanılır.\n\nBu liste, internet geliştikçe büyümeye devam edecektir. Yeni kötü amaçlı yazılımlar her zaman geliştirilecektir. Siber güvenlik operasyonlarının temel amacı, yeni kötü amaçlı yazılımlar hakkında bilgi edinmek ve bunları derhal nasıl azaltmaktır.\n\n## Antivirüslerin Çalışma Prensiplerinin Temeli\n\n\n- **Byte-Signature** ⇒ Yazılımın (virüsün) makine dilindeki karşılığından bir bölümü alınarak tanınır.\n- **Hash-Signature** ⇒ Yazılımın **hash** değeri alınarak tanınır . En ufak bir değişiklikte tanınamaz olacağı için risklidir\n- **Heuristic** ⇒ Sezgisel tanıdır . Kodun içeriğinden çok davranışları izlenerek tanınmaya çalışılır Performans ve zaman kaybettirebilir.\nBu konuyu daha detaylı bir başka makalemizde inceleyeceğiz.O zamana dek hoşçakalın...\n\n",
    "cover": "malware.png",
    "date": "2022-07-01",
    "createdAt": 1656629450258,
    "updatedAt": 1656630168394
  },
  {
    "title": "Ağ Tehditleri",
    "slug": "ag-tehditleri",
    "tags": [
      "network-threat"
    ],
    "description": "ag-tehditleri",
    "categories": [
      "Siber Güvenlik",
      "Network"
    ],
    "content": "Zararlı yazılımlar hakkındaki makalemizden sonra şimdi sıra ağ tehditlerine geldi. En çok bilinen ve kullanılan bazı ağ tehditlerini biraz inceleyelim.\n\n## Denial of Service (DoS) \nDoS saldırıları internete bağlı bir bilgisayarın sunmuş olduğu hizmetleri aksatma ya da kaynaklarını tüketerek çalışmasını durdurmak için yapılan en popüler ve tehlikeli saldırı türlerinden biridir. Hizmet reddi saldırısı olarak adlandırılır.\n\nSiber güvenliğin *Gizlilik, Bütünlük ve Erişilebilirlik* ilkelerinden erişilebilirlik durumunu hedef alır. Sadece web sayfalarına yönelik değildir. MAC Flooding, ICMP Smurf, TCP SYN Flood, DHCP Startvation, DNS Flood HTTP GET Flood, SlowHTTP ve Slowloris DoS Ataklarına örnek olabilir.\n\nHizmet reddi saldırıları tekil bir kaynaktan geldiği zaman DoS, çoklu kaynaktan geldiği zaman ise Distributed Denial of Service (DDoS) olarak adlandırılır.\n\n## Distributed Denial of Service(DDoS)\n\nDağıtılmış DoS Saldırısı (DDoS), DoS saldırısına benzer, ancak birden çok, eşgüdümlü kaynaktan kaynaklanır. Örneğin, bir tehdit aktörü, zombiler olarak bilinen virüslü ana bilgisayarlardan oluşan bir ağ oluşturur. Tehdit aktörü, zombilere kontrol mesajları göndermek için bir komut ve kontrol (CnC) sistemi kullanır. Zombiler sürekli olarak daha fazla ana bilgisayarı bot kötü amaçlı yazılımlarıyla tarar ve enfekte eder. Bot kötü amaçlı yazılımı, bir ana bilgisayara virüs bulaştırmak için tasarlanmıştır ve bu da onu CnC sistemi ile iletişim kurabilen bir zombi haline getirir. Zombi koleksiyonuna botnet denir. Hazır olduğunda, tehdit aktörü CnC sistemine zombilerin botnet'inin DDoS saldırısı gerçekleştirmesini emreder.\n\nAşağıda basit ölçüde animasyonlanmış bir DDoS saldırısını görmekteyiz.\n\n![ddos-gif](https://skorskyfiles.blob.core.windows.net/$web/articles/network-threats/ddos.gif)\n\nDDoS saldırılarını daha detaylı anlamamız için saldırı bileşenlerine göz atmamız gerekebilir. tabloda her bir bileşen kısaca açıklanmıştır.\n| Bileşen| İşlevi |\n|--|--|\n| Zombie | Bu bileşen güvenliği ihlal edilmiş bir grup ana bilgisayarı (yani aracıları) ifade eder. Bu ana bilgisayarlar, robotlar (yani botlar) olarak adlandırılan kötü amaçlı kodları çalıştırır. Zombi kötü amaçlı yazılım sürekli olarak bir solucan gibi kendi kendine yayılmaya çalışır. |\n| Bot | Botlar, bir ana bilgisayara virüs bulaştırmak ve bir işleyici sistemiyle iletişim kurmak için tasarlanmış kötü amaçlı yazılımlardır. Botlar ayrıca tuş vuruşlarını kaydedebilir, şifreleri toplayabilir, paketleri yakalayabilir ve analiz edebilir ve daha fazlasını yapabilir. |\n| Botnet | Bu bileşen kendi kendine yayılan kötü amaçlı yazılımlar (yani botlar) kullanılarak enfekte olmuş ve işleyiciler tarafından kontrol edilen bir grup zombiyi ifade eder. |\n| Handlers - İşleyici |   Bu, zombi gruplarını  **kontrol eden birincil komuta ve kontrol (CnC** veya  **C2)**  sunucusunu ifade eder. Bir botnet'in yaratıcısı, zombileri uzaktan kontrol etmek için Internet Relay Chat'i (IRC) veya C2 sunucusundaki bir web sunucusunu kullanabilir. |\n| Botmaster |   Bu, botnet'i ve işleyicileri kontrol eden tehdit aktörüdür. |\n\n## Pivoting\nDirekt olarak erişim sağlanamayan hostlara aynı ağda yer alan diğer host/makineler üzerinden dolaylı olarak erişim sağlanması_ olarak ifade edilebilir. Böylece direkt erişimin olmadığı makineler de istismara açık hale gelir.\n![pivoting](https://skorskyfiles.blob.core.windows.net/$web/articles/network-threats/pivoting.png)\n\nYukarıdaki görselde yeşil kutu içerisindeki makineler **eth1** ile aynı ağ içerisindedir. Ele geçirilmiş olan makine aynı zamanda **eth0** ile başka bir ağ içerisindedir. Saldırgan kendi sistemi üzerinden direkt olarak **eth1** ağına erişim sağlayamadığı için **10.10.10.129** IP adresine sahip makineye direkt olarak erişemeyecektir. Fakat bu noktada saldırgan; önce ele geçirmiş olduğu **192.168.197.147** IP adresli makineye erişim sağlayıp, sonra buradan **10.10.10.129** IP adresli makineye geçiş yaparak hedefine erişim sağlayabilir, diğer bir deyişle _pivoting_ gerçekleştirebilir.\n\n## BitSquatting ve CyberSquatting\nBitSquatting var olan kurum domainlerinin farklı ama en yakın hallerinin kötü amaçla kullanılmasıdır.\n\nCyberSquatting ise var olan kurum domain adlarının aynısı ancak TLD (Top Level Domain) lerine yakın hallerini alarak son kullanıcıları tuzağa düşürme tekniğidir.\n\nBu konunun biraz daha anlaşılır olması açısından bir örnek verelim. Varsayalım ki facebook.com'a girmek istiyoruz ancak tarayıcımızdaki adres satırında focebook.com yazmakta. Yani ilk hecedeki a harfi yerine o harfi kullanılmış. Bu domaindeki bir değişim olduğundan BitSquatting olarak adlandırılır. Bir diğer özellik olarak tekrar adres satırımıza baktığımızda facebook.cam yazmakta domain bildiğimiz üzere facebook ancak .com yerine .cam uzantısı alınmış bu da CyberSquatting olarak adlandırılmakta.\n\nBu tür saldırılar şirketlerin engelleme gayreti sonucunda son dönemde azalmakta ancak yine de her zaman girdiğimiz sitenin adres satırındaki domainine ve uzantısına dikkat etmemiz gerekebilir.\n\n## Sniffing ve Spoofing\n\nTürkçe karışıklarına bakarak çok bir şey anlayamayacağımız iki siber güvenlik terimi ile karşı karşıyayız. sniffing koklama, spoofing ise aldatma demektir. Siber güvenlikte ise sniffing veri yolunu kesmek anlamına gelirken spoofing ise bir saldırı türüdür.\n\n### Sniffing\n\nBir network ağı üzerinde yer alan veri akışını dinleyerek çözümler ve veriyi ele geçirmeyi amaçlar. Veri trafiği içerisinde yer alan paketleri ele geçirebilmek için o veriyi dinler. Sniffing bu koklama işini gerçekleştirmek için kullanılır. Pasif Sniffing ve aktif Sniffing olmak üzere iki çeşidi yer alır.\n\nPasif Siniffing HUB cihazı olan network ağlarında kullanılır. Ağ ortamında yer alan veriler birden fazla bilgisayara transfer edilir. Bu aşamada veri paketlerini koklamak daha kolay olur.\n\nAktif Sniffing ise, switch cihazlarının kullanıldığı sistemlerde tercih edilir. Sadece belirli bir MAC adresine gönderilen verilerin saldırganlar tarafından MAC adresini istemci gibi gösterip Switch cihazının beynini karıştırır. Bu şekilde Switch cihazının HUB olarak çalışmasını sağlar ve tüm portlardan veri çıkar.\n\n### Spoofing\n\nSpoofing (Aldatma) saldırılarında, güvenli olarak görünen kaynaktan paket gönderilerek alıcıyı aldatmaktır. Hedefinde yer alan sistemlerde saldırı yapabilmek için çeşitli yazılımlar kullanır. Birçok spoofing saldırı türü vardır biz ise en çok kullanılan türlerine bakalım.\n\n\n**E-Mail Spoofing** ⇒  SMTP açıklarından faydalanarak e mail başlıklarının değiştirilmesiyle yapılır\n\n\n**ARP Spoofing** ⇒ ARP Spoofing saldırısı yapacak kişi yerel ağı sahte paketler ile doldurur. Bu aşamada veriler alıcıya ulaşmadan önce saldırgana ulaşır. Bu aşamada saldırgan isterse verileri de bozabilir ya da değiştirebilir. Cihazın sahip olduğu IP adresi saldırı düzenlenen kişinin IP adresine benzer şekilde ayarlanır.\n \n\n**MAC Spoofing** ⇒ Switch’in MAC tablosunun manipüle edilmesidir . Saldırganın bağlı olduğu porta, hedefin MAC’ini bildirmesiyle yapılır\n\n**DNS Spoofing** ⇒ DNS sunucusundaki önbelleğin manüpile edilmesidir . RR’ların değiştirilerek cevapların yanıltılması ve yönlendirmeyle sonuçlanır\n\n**URL Spoofing** ⇒ Farklı bir url adresi gönderilerek gerçekleşir. Eski internet tarayıcılarında işe yarayan bu yöntem, yeni tarayıcılarda işe yaramıyor. Bir saldırgan hedefinde olduğu kişiye benzer bir url linki göndererek eylemini gerçekleştirir.\n\n**IP Spoofing** ⇒ Saldırganların bilgisayara yetkisiz erişim elde etme amacı ile kullanılan bir saldırı yöntemidir. Burada siber saldırganlar kendini gizleyerek saldırıyı gerçekleştirir. Veri paketlerini gönderirken farklı bir IP adresi ile değiştirerek gönderir. Farklı bir bilgisayardan gönderilmiş gibi gözükmesini sağlar.\nSaldırı yapılan bilgisayar gerçek kaynağı göremez. Bu IP Spoofing saldırıları tüm protokollerde gerçekleştirilebilir. Sadece TCP protokollerini kullanan uygulamalarda IP Spoofing saldırısı gerçekleştirilemez.\nUDP protokolünü kullanan uygulamalarda rahat bir şekilde saldırı girişiminde bulunulabilir. Bunun nedeni ise, TCP protokolünde üçlü el sıkışmasının zorunlu hale gelmesidir.\n\n## Session Hijacking\n\nSession Hijacking (oturum ele geçirme), bir kullanıcı oturumunun bir saldırgan tarafından ele geçirildiği bir saldırı türüdür. Bir oturum, örneğin bir uygulama hizmetine oturum açıldığında başlar ve oturum kapatıldığında sona erer. Saldırganın oturum çereziniz hakkında bilgi sahibi olma durumuna göre, saldırı, aynı zamanda çerez kaçırma veya çerez yan saldırısı olarak da adlandırılır. Bazen herhangi bir bilgisayar oturumu ele geçirilmesine rağmen, Session Hijacking en yaygın olarak tarayıcı oturumları ve web uygulamaları için geçerlidir.\n\nSession Hijacking, bir saldırganın çoğu web sitesinde bir oturumu sürdürmek için kullanılan HTTP çerezlerini çalarak tehlikeye atılmış bir etkin oturumdan yararlanmasıyla gerçekleşir. Başka bir yol ise saldırganın belirli bir kullanıcının kimlik bilgilerini kullandığından, uzak bir web sunucusundaki bilgilere yetkisiz erişim elde etmek için etkin bir oturumun tahmin etmesidir. Oturum belirteci veya HTTP başlığının güvenliği manipıle edilebilir ve bunlar oturum koklama (Session Sniffing) ve siteler arası komut dosyası çalıştırma (XSS) saldırılarını içerir.\n\n> Son dönemde bazı youtuber hesaplarının çalınması bu yöntem ile gerçekleştirilmişitr.\n\n## Sosyal Mühendislik\n\n\nSosyal mühendislik, hedeflenen bir kurbanı hassas bilgi ve verilerini vermesi için psikolojik olarak manipüle etmeyi amaçlayan siber suçlular tarafından gerçekleştirilen bir dizi kötü niyetli faaliyettir.\n\nSosyal mühendislik özellikle ağ sistemlerinde, yazılımlarda ve işletim sistemlerindeki güvenlik açıklarından ziyade insan hatasına dayanır. Meşru kullanıcılar tarafından yapılan hatalar daha az tahmin edilebilir olduğundan, bunları tespit etmek, kötü amaçlı yazılım tabanlı izinsiz girişleri tespit etmekten daha zordur. \n\n## OWASP TOP 10\n\nBuraya kadar birçok saldırı türü saydık. Peki günüöüzde en çok kullanılan saldırı türleri nelerdir. Bunu incelemek için OWASP'ten yardım alalım. Peki nedir OWASP?\n\n**OWASP** açılımı Open Web Application Security Project olarak tanımlanır. Web uygulamalarındaki güvenlik açıklarının kapatılması ve bu uygulamaların güvenli bir şekilde korunmasını sağlamak için çalışmalar yapan özgür bir topluluktur. OWASP topluluğunun her üç ya da dört senede bir yenilediği OWASP Top 10 ismiyle o yıla ait en riskli güvenlik zafiyetlerini listeledikleri Top 10 listesi hazırlamaktadır. Ayrıca risklerini, etkilerini ve karşı önlemlerini de gösterir. En son OWASP güvenlik açıkları listesi 2021'de yayınlandı. \n\n- A1 Broken Access Control\n- A2 Cryptographic Failures\n- A3 Injection\n- A4 Insecure Design\n- A5 Security Misconfiguration\n- A6 Vulnerable and Outdated Components\n- A7 Identification and Authentication Failures\n- A8 Software and Data Integrity Failures\n- A9 Security Logging and Monitoring Failures\n- A10 Server-Side Request Forgery\n\nBu açıkların her birinin bir başka makalemizde detaylı şekilde inceleyene dek görüşmek üzere\n\n",
    "ID": "f714df12-432e-42c9-be19-3b2ccf5b7e73",
    "cover": "ag-tehditleri.png",
    "date": "2022-07-02",
    "createdAt": 1656693993640,
    "updatedAt": 1656695187441
  },
  {
    "tags": [
      "penetrasyon-testing"
    ],
    "categories": [
      "Siber Güvenlik"
    ],
    "description": "Temel Hatlarıyla Penetrasyon Testleri",
    "ID": "b9e98045-2b55-4146-9428-5d05f6f19882",
    "content": "## Penetrasyon - Sızma Testi Nedir?\n\n**Penetrasyon testi - Pentest**  şirketin güvenlik becerilerini üst düzeyde tutmak, Dışarıdan gelebilecek saldırıları görüp önlem almak, Sistemlerinize yapılan yatırımı güvende tutmak ve en önemlisi de güvenlik açıkları nedeniyle oluşabilecek bilgi kayıplarına engel olabilmek için  **pentest - penetrasyon testi**  yapılmalıdır. Penetrasyon testlerini yapan kişiye ise **Pentester** denir.\n\nPenetrasyon testleri üç farklı şekilde yapılır.\n### Blackbox Pentest\n\nPentester, test yapılacak sisteme dair hiçbir bilgi sahibi olmadan saldırıyı gerçekleştirerek sisteme dahil olmaya çalışır. Pentester yabancı biri davranarak herhangi bir hackerın uygulayacağı senaryoları sistem üzerinde dener.\n\n### Greybox Pentest\n\nİç networkte bulunan yetkisiz bir personelin veya misafir ağına bağlanmış bir müşterinin sisteme verebileceği zararın analiz edilmesini sağlar. Veri çalınması, yetki yükseltme ve network paket kaydedicilerine karşı zayıflıklar denetlenir. Sistem hakkında en minimum düzeyde bilgi sahibi olunarak test edilir ve en önemli sızma testi türüdür.\n\n### Whitebox Pentest\n\nNetworkteki tüm sistemler hakkında bilgi sahibi olunarak yapılan sızma testi türüdür. Çalışanlardan birisinin içeriden networke girip zarar vermeye çalışmasının simüle edilmiş halidir.\n\n## Penetrasyon Testi ve Modelleri\n\nSızma testleri yapılırken bazı modeller izlenerek testin karmaşıklaşması önlenmeye çalışılır. İzlenilen birçok model vardır ancak biz iki tanesine değinelim. \n\n![penetrasyon-model-1](https://skorskyfiles.blob.core.windows.net/$web/articles/penetrasyon-testleri/penetrasyon1.png)\n\nİlk modelimiz yukarıdaki şekilde şematize edilmiştir.\n\n 1. **Information Gathering** ⇒ İlk aşama, hedef hakkında pasiften (hedef ile etkileşim olmadan) aktife (etkileşimli) bilgi toplamadır.\n 2. **Threat Modeling** ⇒ Toplanan bilgiler doğrultusunda kullanılacak olan tehditler planlanır. Buna tehdit modelleme denir\n 3. **Vulnerability Analysis** ⇒ Planlanan tehditler sonrası güvenlik açığı arama ve analiz etme aşamasıdır. Sistem içerisindeki en zayıf halka aranır.\n 4. **Exploitation** ⇒ Bulunan güvenlik açıklarının sömürülmesi denenir. Başarılı olunursa sisteme giriş de sağlanmış olur.\n 5. **Post Ecploitation** ⇒ Sömürünün sürdürülebilirliği için diğer sistemlerde de kalıcılığı amaçlanır. Bu sebeple sistem içerisinde yayılmaya çalışılır.\n 6. **Repoting** ⇒ Hedefin tüm aşamalardaki güçlü ve zayıf yönlerinin ayrıntılı olarak raporlanmasıdır\n\n![penetrasyo2](https://skorskyfiles.blob.core.windows.net/$web/articles/penetrasyon-testleri/penetrasyon2.png)\n\n1. **Reconnaissance** ⇒ İlk aşama hedef hakkında pasiften aktife doğru bilgi toplama aşamasıdır.\n2. **Scanning** ⇒ Toplanan bilgiler doğrultusunda kullanılacak tehditler planlanır ve en zayıf halka aranır\n3. **Exploitation/Gaining Access** ⇒ Bulunan güvenlik açıklarının sömürülmesi denenir. Başarılı olunursa  isteme giriş de sağlanmış olur\n4. **Maintaining Access** ⇒ Sömürünün sürdürülebilirliği için diğer sistemlerde de kalıcılık amaçlanır . Bu sebeple yayılmak da hedeflenir\n5. **CoveringTracks** ⇒Hack işleminin izlerini yok etme aşamasıdır . Delil yok etmek ve temizlik amaçlanır\n\nGörüldüğü üzere modellerde her ne kadar benzerlik olsa da bazı alanlar farklılık göstermekte ve pentesterler hangi modeli seçeceğine bireysel veya kurumsal düzeyde karar verebilirler.\n\n## Cyber Kill Chain - Bir Saldırının Yaşam Döngüsü\n\nSiber saldırıları analiz edebilmek amacıyla çeşitli modellerden birisi olan ve Locheed Martin firması tarafından geliştirilen cyber kill chain keşif aşamasından saldırı aşamasına kadar tanımlayan ve bu saldırıyı gerçekleştirmek veya önlemek amacıyla oluşturulan 7 aşamalı bir modeldir.\n\nAskeri terminolojideki Ölüm Zinciri ’nden esinlenerek Lockheed Martin tarafından geliştirilmiştir Aşağıdaki aşamalardan oluşur.![cyber-kill-chain](https://skorskyfiles.blob.core.windows.net/$web/articles/penetrasyon-testleri/cyber-kill-chain.png)\n\n1. **Reconnaissance**\n\nSaldırı gerçekleşmeden veya bir istismar yaratılmadan önce keşif ve bilgi toplama aşamasıdır. Saldıran taraf; hedef sistem veya sistemler üzerinde çeşitli taramalar gerçekleştirerek zafiyetleri tespit etmeye çalışır ayrıca çalışanların isimleri, görevleri, e-mail adresleri, ip adresleri, ağ haritası çıkarma gibi eylemleri aktif ve pasif bilgi toplama araçlarıyla yapabildiği gibi, iş ilanları , linkedln , twitter , facebook , instagram gibi sosyal medya aracılığıyla hedef hakkında sosyal mühendislik yöntemleri ile bilgiler toplayabilir.\n\n**Pasif Bilgi Toplama:** Hedef ile direkt olarak temasa geçilmeden bilgi toplama çeşitidir. (Shodan vb)\n\n**Aktif Bilgi Toplama:** Hedef ile direkt olarak temasa geçilen bilgi toplama çeşitidir. (Port scan vb.)\n\n2. **Weaponization**\n\nKeşif sırasında bulunan zafiyetlerin sömürülmesi için kullanılacak yöntemlerin belirlenmesi ve uygun araçları hazırlama olarak tanımlanan aşamadır. Bu aşamada zafiyete uygun exploitler, zafiyetin istismar edilmesi için kullanılabilecek payloadlar olabileceği gibi zararlı dosyalar ve dokümanlar, oltalama saldırısında kullanılabilecek sahte epostalar gibi birçok yöntem kullanılarak sızma işlemi gerçekleştirilebilir.\n\n3.  **Delivery**\n\nHazırlanan zararlının ve belirlenen yöntemle hedefe iletilmesi bu aşamadadır. Çeşitli açık kaynak kodlu yazılımlar, phishing, sosyal networkler veya tünellemeler gibi yöntemler kullanılabileceği gibi, güvenlik olarak çalışanların sosyal mühendisliklere veya phishing saldırılarına karşı farkındalıkları, çalışanların hangi donanımların kurum ağına bağlanabildiği veya bağlanamadığı konusunda bilgilendirmesi, bilinen zararlı veya şüpheli web sitelerinin erişim bloklarının kontrol edilmesi bu aşamayı önleyebilir.\n\n4.  **Exploitation**\n\nOluşturulan zararlı ve belirlenen atak vektörünü kullanarak hedefin zafiyetinin sömürüldüğü aşamadır. Exploit hazırlanıp hedefe iletildikten sonra bu aşamada zararlı kod çalıştırılır. Bunu önlemek amacıyla yazılımlar ne sıklıkla güncellendiği , sistemdeki zafiyetlerin tespit edilmesi için güvenlik denetimleri yapılıp yapılmadığı kontrol edilebilir.\n\n5.  **Installation**\n\nHedefin sömürülmesi ardından, kalıcı bir tehdit haline gelmek, güvenlik sisteminin ötesinde sistem başarılı bir şekilde kontrol edilebilmesi için hedefe asıl zararlı yazılımın indirilmesi, zararlı yazılımın sistemde kalacağı süreyi mümkün olduğunca arttırmayı hedefleyen aşamadır. Sistemde çalışan bilgisayarlarla yüklenen yazılımların denetlenmesi, kullanıcıların istedikleri yazılımları bilgisayarlara yükleyebilirlikleri, whitelisting ve blacklisting oluşturma bu aşamayı önleyebilir.\n\n6. **Command and Control, c&c**\n\nSisteme yerleşmiş olan zararlının çalışması uzaktan kontrol edilebildiği ve sistemin ele geçirildiği aşamadır. Bu aşama için saldırıyı engelelyebilircek firewall ve ips‘in devrede olup olmadığı iyi konfigüre edilip edilmediği ve güvenlik cihazlarının monitör edilebiliriliği bu aşamayı aksatmak için önemli unsur taşımakta.\n\n7. **Actions on objectives**\n\nBütün aşamaları gerçekleştiren saldırgan kuruma erişim sağlamıştır ve bu aşamada, veri çalma, veri değiştirme , veri silme , veri şifreleme, sisteme zarar verme gibi eylemleri gerçekleştirebilir. Önlem olarak iç ağdan dışarı yapılan veri akışı sınırlandırılması, sadece bilinen sunuculara veri akışını sağlama ( whitelisting ) oluşturulduğunda saldırı engellenebilir. Bu süreçte tehdit altındaki verilerin yedeklerinin önceden alınması, bir sistem devre dışı kaldığında hizmet verebilecek yedek sistemin olması bu saldırının etkilerini azaltabilir.",
    "slug": "temel-hatlariyla-penetrasyon-testleri",
    "title": "Temel Hatlarıyla Penetrasyon Testleri",
    "cover": "penetrasyon-testi.png",
    "date": "2022-07-03",
    "createdAt": 1656781357808
  }
]